app/views/tasks/_form.html.erb

SELECT "tasklists".* FROM "tasklists"
SELECT "tags".* FROM "tags"
SELECT "tasks".* FROM "tasks"
SELECT 1 AS one FROM "tags" INNER JOIN "tags_tasks" ON "tags"."id" = "tags_tasks"."tag_id" WHERE "tags_tasks"."task_id" IS NULL AND "tags"."id" = 1 LIMIT 1
---

  <%= f.select :tasklist_id, Tasklist.all.collect {|t| [ t.name, t.id ] }, {:prompt => 'Select Tasklist'} %>

  <% Tag.all.each do |tag| %>
    <%= check_box_tag 'task[tag_ids][]', tag.id, @task.tags.include?(tag) %>