app/views/tasks/index.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "tags_tasks" ON "tags"."id" = "tags_tasks"."tag_id" WHERE "tags_tasks"."task_id" = 2
---
      <td style="isplay:none;">
        <% task.tags.map(&:name) %>