app/views/tags/_form.html.erb

SELECT "tags".* FROM "tags"
SELECT "tasks".* FROM "tasks" INNER JOIN "tags_tasks" ON "tasks"."id" = "tags_tasks"."task_id" WHERE "tags_tasks"."tag_id" = 3
---
  <%# task=Task.all %>
    <%= select_tag 'tag[task_ids][]', options_from_collection_for_select(Task.all, "id", "name",  @tag.tasks.map(&:id)), multiple: true, include_blank: false %>