app/controllers/tasks_controller.rb

  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO "tags_tasks" ("task_id", "tag_id") VALUES (4, 1)
INSERT INTO "tasks" ("Tasklist_id", "created_at", "name", "status", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Tasklist_id", nil], ["created_at", Tue, 30 Apr 2013 15:28:42 UTC +00:00], ["name", "ththth"], ["status", false], ["updated_at", Tue, 30 Apr 2013 15:28:42 UTC +00:00]]

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "tasks" SET "name" = 'http://ru.wikipedia.org/wiki/%D0%91%D0%B0%D1%80%D1%83%D1%85,_%D0%91%D0%B5%D1%80%D0%BD%D0%B0%D1%80%D0%B4', "updated_at" = '2013-04-16 11:08:32.367763' WHERE "tasks"."id" = 2